perf/async/endurance.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Subida
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Constante
        duration: 30
        arrivalRate: 5

scenarios:
  - name: async Endurance (/async)
    flow:
      - get:
          url: '/async'